CSI API ETABS v1
cCombo.DeleteCase Method
 Deletes one load case or load combination from the list of cases included in the specified load combination.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int DeleteCase(
	string Name,
	eCNameType CNameType,
	string CName
)
Function DeleteCase (
	Name As String,
	CNameType As eCNameType,
	CName As String
) As Integer
Dim instance As cCombo
Dim Name As String
Dim CNameType As eCNameType
Dim CName As String
Dim returnValue As Integer
returnValue = instance.DeleteCase(Name,
	CNameType, CName)
int DeleteCase(
	String^ Name,
	eCNameType CNameType,
	String^ CName
)
abstract DeleteCase :
        Name : string *
        CNameType : eCNameType *
        CName : string -> int
Parameters
Name
Type: System.String
 The name of an existing load combination.
CNameType
Type: ETABSv1.eCNameType
 This is one of the following items in the eCNameType enumeration:
LoadCase = 0
LoadCombo = 1
 This item indicates whether the CName item is an analysis case (LoadCase) or a load combination (LoadCombo).
CName
Type: System.String
 The name of the load case or load combination to be deleted from the specified combination.
Return Value
Type: Int32
 Returns zero if the item is successfully deleted, otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add combo
       ret = SapModel.RespCombo.Add("COMB1", 0)
   'add load case to combo
       ret = SapModel.RespCombo.SetCaseList("COMB1", LoadCase, "DEAD", 1.4)
   'delete load case from combo
       ret = SapModel.RespCombo.DeleteCase("COMB1", LoadCase, "DEAD")
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cCombo Interface
ETABSv1 Namespace